Catalogs/бит_ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ВидыКонтактнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноРедактироватьТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ВидыКонтактнойИнформации/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью" формы.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Порядок = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидОбъектаКонтактнойИнформации) И Не Отказ И Порядок = 0 Тогда
		УстановитьПорядок();
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик события "ПриЗаписи" формы.
//
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если (НЕ ОбменДанными.Загрузка) И (НЕ ЗначениеЗаполнено(ВидОбъектаКонтактнойИнформации) ИЛИ НЕ ЗначениеЗаполнено(Тип)) Тогда
		#Если Клиент Тогда
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ПриЗаписиЗавершение", ЭтотОбъект, Новый Структура("Отказ", Отказ)), "Укажите вид и тип объекта контактной информации.");
            Возврат;
		#КонецЕсли
		
		ПриЗаписиФрагмент(Отказ);

	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписиЗавершение(ДополнительныеПараметры) Экспорт
    
    Отказ = ДополнительныеПараметры.Отказ;
    
    ПриЗаписиФрагмент(Отказ);

КонецПроцедуры

Процедура ПриЗаписиФрагмент(Знач Отказ)
    
    Отказ = Истина;

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура утановки порядка.
//
Процедура УстановитьПорядок()

	ТЗ = "ВЫБРАТЬ
	|	МАКСИМУМ(ВидыКонтактнойИнформации.Порядок) КАК Порядок
	|ИЗ
	|	Справочник.бит_ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации";
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТЗ;
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", ВидОбъектаКонтактнойИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Порядок = ?(Выборка.Следующий() И Выборка.Порядок <> Null, Выборка.Порядок+1, 1);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
